# SetNumericRevisionSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevisionNumberingSequence..::..SetNumericRevisionSettings Method
RevisionNumberingSequence Class See Also
---
Replaces the current numeric revision numbering settings with the provided settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void SetNumericRevisionSettings(
	NumericRevisionSettings settings
)
```

Visual Basic
---
```text
Public Sub SetNumericRevisionSettings ( _
	settings As NumericRevisionSettings _
)
```

Visual C++
---
```text
public:
void SetNumericRevisionSettings(
	NumericRevisionSettings^ settings
)
```

# ### Parameters
settings
    Type: Autodesk.Revit.DB..::..NumericRevisionSettings The NumericRevisionSettings to be applied to numeric revision numbering.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | settings is not a valid NumericRevisionSettings. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace